lkolbly/cmsis-svd/data/NXP/LPC55S66_cm33_core0.svd
        <register>
          <name>PLL_SIC_CLR</name>
          <description>USB PHY PLL Control/Status Register</description>
          <addressOffset>0xA8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xD12000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_EN_USB_CLKS</name>
              <description>Enables the USB clock from PLL to USB PHY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_POWER</name>
              <description>Power up the USB PLL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>Enables the clock output from the USB PLL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBIAS_PWD_SEL</name>
              <description>Reference bias power down select.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Selects PLL_POWER to control the reference bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Selects REFBIAS_PWD to control the reference bias</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBIAS_PWD</name>
              <description>Power down the reference bias This bit is only used when REFBIAS_PWD_SEL is set to 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_ENABLE</name>
              <description>This field controls the USB PLL regulator, set to enable the regulator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIV_SEL</name>
              <description>This field controls the USB PLL feedback loop divider</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Divide by 13</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Divide by 15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Divide by 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Divide by 20</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>Divide by 22</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>Divide by 25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>Divide by 30</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Divide by 240</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PREDIV</name>
              <description>This is selection between /1 or /2 to expand the range of ref input clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOCK</name>
              <description>USB PLL lock status indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>PLL is not currently locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PLL is currently locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL_SIC_TOG</name>
          <description>USB PHY PLL Control/Status Register</description>
          <addressOffset>0xAC</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xD12000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL_EN_USB_CLKS</name>
              <description>Enables the USB clock from PLL to USB PHY</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_POWER</name>
              <description>Power up the USB PLL</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_ENABLE</name>
              <description>Enables the clock output from the USB PLL</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBIAS_PWD_SEL</name>
              <description>Reference bias power down select.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Selects PLL_POWER to control the reference bias</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Selects REFBIAS_PWD to control the reference bias</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REFBIAS_PWD</name>
              <description>Power down the reference bias This bit is only used when REFBIAS_PWD_SEL is set to 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_REG_ENABLE</name>
              <description>This field controls the USB PLL regulator, set to enable the regulator</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_DIV_SEL</name>
              <description>This field controls the USB PLL feedback loop divider</description>
              <bitOffset>22</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Divide by 13</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Divide by 15</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Divide by 16</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>Divide by 20</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>Divide by 22</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>Divide by 25</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>Divide by 30</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>Divide by 240</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL_PREDIV</name>
              <description>This is selection between /1 or /2 to expand the range of ref input clock.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL_LOCK</name>
              <description>USB PLL lock status indicator</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>PLL is not currently locked</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>PLL is currently locked</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USB1_VBUS_DETECT</name>
          <description>USB PHY VBUS Detect Control Register</description>
          <addressOffset>0xC0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x700004</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VBUSVALID_THRESH</name>
              <description>Sets the threshold for the VBUSVALID comparator</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>4.0V</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>4.1V</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>4.2V</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value3</name>
                  <description>4.3V</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value4</name>
                  <description>4.4V(Default)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value5</name>
                  <description>4.5V</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value6</name>
                  <description>4.6V</description>
                  <value>0x6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value7</name>
                  <description>4.7V</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_OVERRIDE_EN</name>
              <description>VBUS detect signal override enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Use the results of the internal VBUS_VALID and Session Valid comparators for VBUS_VALID, AVALID, BVALID, and SESSEND (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the override values for VBUS_VALID, AVALID, BVALID, and SESSEND</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SESSEND_OVERRIDE</name>
              <description>Override value for SESSEND The bit field provides the value for USB1_VBUS_DET_STAT[0] if USB_VBUS_DETECT[3] is set to value 1'b1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BVALID_OVERRIDE</name>
              <description>Override value for B-Device Session Valid The bit field provides the value for USB1_VBUS_DET_STAT[1] if USB_VBUS_DETECT[3] is set to value 1'b1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVALID_OVERRIDE</name>
              <description>Override value for A-Device Session Valid The bit field provides the value for USB1_VBUS_DET_STAT[2] if USB_VBUS_DETECT[3] is set to value 1'b1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_OVERRIDE</name>
              <description>Override value for VBUS_VALID signal sent to USB controller The bit field provides the value for VBUS_VALID reported to the USB controller if the value of USB1_VBUS_DETECT[3] is set to 1'b1</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBUSVALID_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB controller This is one of the bit fields that selects the source of the VBUS_VALID signal reported to the USB controller</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB controller (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the VBUS_VALID_3V detector results for signal reported to the USB controller</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUS_SOURCE_SEL</name>
              <description>Selects the source of the VBUS_VALID signal reported to the USB controller This is one of the bit fields that selects the source of the VBUS_VALID signal reported to the USB controller</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Use the VBUS_VALID comparator results for signal reported to the USB controller (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB controller</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value2</name>
                  <description>Use the Session Valid comparator results for signal reported to the USB controller</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ID_OVERRIDE_EN</name>
              <description>Enable ID override using the register field. This bit is only used if EXT_ID_OVERRIDE_EN = 1'b0.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ID_OVERRIDE</name>
              <description>ID override value.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EXT_ID_OVERRIDE_EN</name>
              <description>Enable ID override using the pinmuxed value:</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Select the Muxed value chosen using ID_OVERRIDE_EN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Select the external ID value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EXT_VBUS_OVERRIDE_EN</name>
              <description>Enable VBUS override using the pinmuxed value.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Select the Muxed value chosen using VBUS_OVERRIDE_EN.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Select the external VBUS VALID value.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_TO_SESSVALID</name>
              <description>Selects the comparator used for VBUS_VALID This bit field controls the comparator used to report the VBUS_VALID results in USB1_VBUS_DETECT[3] between the VBUS_VALID comparator and the Session Valid comparator</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Use the VBUS_VALID comparator for VBUS_VALID results</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Use the Session End comparator for VBUS_VALID results. The Session End threshold is &gt;0.8V and &lt;4.0V.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VBUSVALID_5VDETECT</name>
              <description>no description available</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PWRUP_CMPS</name>
              <description>Enables the VBUS_VALID comparator: Powers up the comparator used for the VBUS_VALID detector</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>Powers down the VBUS_VALID comparator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>Enables the VBUS_VALID comparator (default)</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DISCHARGE_VBUS</name>
              <description>Controls VBUS discharge resistor This bit field controls a nominal 22kohm resistor between the USB1_VBUS pin and ground</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>value0</name>
                  <description>VBUS discharge resistor is disabled (Default)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>value1</name>
                  <description>VBUS discharge resistor is enabled</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
