lkolbly/cmsis-svd/data/NXP/LPC55S66_cm33_core0.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DBGMAILBOX</name>
      <description>MCU Debugger Mailbox</description>
      <groupName>DBGMAILBOX</groupName>
      <baseAddress>0x4009C000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CSW</name>
          <description>CRC mode register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0x3F</resetMask>
          <fields>
            <field>
              <name>RESYNCH_REQ</name>
              <description>Debugger will set this bit to 1 to request a resynchronrisation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REQ_PENDING</name>
              <description>Request is pending from debugger (i.e unread value in REQUEST)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_OR_ERR</name>
              <description>Debugger overrun error (previous REQUEST overwritten before being picked up by ROM)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AHB_OR_ERR</name>
              <description>AHB overrun Error (Return value overwritten by ROM)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFT_RESET</name>
              <description>Soft Reset for DM (write-only from AHB, not readable and selfclearing). A write to this bit will cause a soft reset for DM.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CHIP_RESET_REQ</name>
              <description>Write only bit. Once written will cause the chip to reset (note that the DM is not reset by this reset as it is only resettable by a SOFT reset or a POR/BOD event)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQUEST</name>
          <description>CRC seed register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>REQ</name>
              <description>Request Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RETURN</name>
          <description>Return value from ROM.</description>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RET</name>
              <description>The Return value from ROM.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ID</name>
          <description>Identification register</description>
          <addressOffset>0xFC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x2A0000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ID</name>
              <description>Identification value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC0</name>
      <description>ADC</description>
      <groupName>ADC</groupName>
      <baseAddress>0x400A0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>ADC0</name>
        <value>22</value>
      </interrupt>
      <registers>
        <register>
          <name>VERID</name>
          <description>Version ID Register</description>
          <addressOffset>0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x1002C0B</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RES</name>
              <description>Resolution</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RES_0</name>
                  <description>Up to 13-bit differential/12-bit single ended resolution supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RES_1</name>
                  <description>Up to 16-bit differential/16-bit single ended resolution supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIFFEN</name>
              <description>Differential Supported</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIFFEN_0</name>
                  <description>Differential operation not supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIFFEN_1</name>
                  <description>Differential operation supported. CMDLa[CTYPE] controls fields implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MVI</name>
              <description>Multi Vref Implemented</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MVI_0</name>
                  <description>Single voltage reference high (VREFH) input supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MVI_1</name>
                  <description>Multiple voltage reference high (VREFH) inputs supported.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CSW</name>
              <description>Channel Scale Width</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CSW_0</name>
                  <description>Channel scaling not supported.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSW_1</name>
                  <description>Channel scaling supported. 1-bit CSCALE control field.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSW_6</name>
                  <description>Channel scaling supported. 6-bit CSCALE control field.</description>
                  <value>0x6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>VR1RNGI</name>
              <description>Voltage Reference 1 Range Control Bit Implemented</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>VR1RNGI_0</name>
                  <description>Range control not required. CFG[VREF1RNG] is not implemented.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VR1RNGI_1</name>
                  <description>Range control required. CFG[VREF1RNG] is implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>IADCKI</name>
              <description>Internal ADC Clock implemented</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IADCKI_0</name>
                  <description>Internal clock source not implemented.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IADCKI_1</name>
                  <description>Internal clock source (and CFG[ADCKEN]) implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CALOFSI</name>
              <description>Calibration Function Implemented</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CALOFSI_0</name>
                  <description>Calibration Not Implemented.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CALOFSI_1</name>
                  <description>Calibration Implemented.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUM_SEC</name>
              <description>Number of Single Ended Outputs Supported</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUM_SEC_0</name>
                  <description>This design supports one single ended conversion at a time.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUM_SEC_1</name>
                  <description>This design supports two simultanious single ended conversions.</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NUM_FIFO</name>
              <description>Number of FIFOs</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NUM_FIFO_0</name>
                  <description>N/A</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUM_FIFO_1</name>
                  <description>This design supports one result FIFO.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUM_FIFO_2</name>
                  <description>This design supports two result FIFOs.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUM_FIFO_3</name>
                  <description>This design supports three result FIFOs.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NUM_FIFO_4</name>
                  <description>This design supports four result FIFOs.</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>MINOR</name>
              <description>Minor Version Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MAJOR</name>
              <description>Major Version Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PARAM</name>
          <description>Parameter Register</description>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0xF041010</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>TRIG_NUM</name>
              <description>Trigger Number</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FIFOSIZE</name>
              <description>Result FIFO Depth</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FIFOSIZE_1</name>
                  <description>Result FIFO depth = 1 dataword.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOSIZE_4</name>
                  <description>Result FIFO depth = 4 datawords.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOSIZE_8</name>
                  <description>Result FIFO depth = 8 datawords.</description>
                  <value>0x8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOSIZE_16</name>
                  <description>Result FIFO depth = 16 datawords.</description>
                  <value>0x10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOSIZE_32</name>
                  <description>Result FIFO depth = 32 datawords.</description>
                  <value>0x20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOSIZE_64</name>
                  <description>Result FIFO depth = 64 datawords.</description>
                  <value>0x40</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CV_NUM</name>
              <description>Compare Value Number</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CMD_NUM</name>
              <description>Command Buffer Number</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
